# Iris

### Introduction:

This exercise may seem a little bit strange, but keep doing it.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

pd.set_option("display.float_format", "{:,.2f}".format)
pd.set_option("display.max_columns", None)

### Step 2. Import the dataset from this [address](https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data).

In [2]:
path = "../../data/iris.data"
df = pd.read_csv(path, header=None)
df.head()

     0    1    2    3            4
0 5.10 3.50 1.40 0.20  Iris-setosa
1 4.90 3.00 1.40 0.20  Iris-setosa
2 4.70 3.20 1.30 0.20  Iris-setosa
3 4.60 3.10 1.50 0.20  Iris-setosa
4 5.00 3.60 1.40 0.20  Iris-setosa

### Step 3. Assign it to a variable called iris

In [3]:
iris = df.copy()
iris

       0    1    2    3               4
0   5.10 3.50 1.40 0.20     Iris-setosa
1   4.90 3.00 1.40 0.20     Iris-setosa
2   4.70 3.20 1.30 0.20     Iris-setosa
3   4.60 3.10 1.50 0.20     Iris-setosa
4   5.00 3.60 1.40 0.20     Iris-setosa
..   ...  ...  ...  ...             ...
145 6.70 3.00 5.20 2.30  Iris-virginica
146 6.30 2.50 5.00 1.90  Iris-virginica
147 6.50 3.00 5.20 2.00  Iris-virginica
148 6.20 3.40 5.40 2.30  Iris-virginica
149 5.90 3.00 5.10 1.80  Iris-virginica

[150 rows x 5 columns]

### Step 4. Create columns for the dataset

In [4]:
cols = [ "sepal_length (in cm)"
       , "sepal_width (in cm)"
       , "petal_length (in cm)"
       , "petal_width (in cm)"
       , "class"]
iris.columns = cols
iris.head()

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm),class
0,5.10,3.50,1.40,0.20,Iris-setosa
1,4.90,3.00,1.40,0.20,Iris-setosa
2,4.70,3.20,1.30,0.20,Iris-setosa
3,4.60,3.10,1.50,0.20,Iris-setosa
4,5.00,3.60,1.40,0.20,Iris-setosa

### Step 5.  Is there any missing value in the dataframe?

In [5]:
iris.isna().sum()

sepal_length (in cm)    0
sepal_width (in cm)     0
petal_length (in cm)    0
petal_width (in cm)     0
class                   0
dtype: int64

### Step 6.  Lets set the values of the rows 10 to 29 of the column 'petal_length' to NaN

In [6]:
iris.loc[10:29, "petal_length (in cm)"] = np.nan

In [7]:
iris.isna().sum()

sepal_length (in cm)     0
sepal_width (in cm)      0
petal_length (in cm)    20
petal_width (in cm)      0
class                    0
dtype: int64

### Step 7. Good, now lets substitute the NaN values to 1.0

In [8]:
iris.fillna(1
            , inplace=True)
iris.isna().sum()

sepal_length (in cm)    0
sepal_width (in cm)     0
petal_length (in cm)    0
petal_width (in cm)     0
class                   0
dtype: int64

### Step 8. Now let's delete the column class

In [9]:
iris.drop(columns=["class"]
          , axis=0
          , inplace=True)
iris.head()

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
0,5.10,3.50,1.40,0.20
1,4.90,3.00,1.40,0.20
2,4.70,3.20,1.30,0.20
3,4.60,3.10,1.50,0.20
4,5.00,3.60,1.40,0.20

### Step 9.  Set the first 3 rows as NaN

In [10]:
iris.iloc[:3,:]=np.nan
iris.head()

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
0,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN
3,4.60,3.10,1.50,0.20
4,5.00,3.60,1.40,0.20

### Step 10.  Delete the rows that have NaN

In [11]:
iris.dropna(axis=0
            , how="any"
            , inplace=True)
iris.head()

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
3,4.60,3.10,1.50,0.20
4,5.00,3.60,1.40,0.20
5,5.40,3.90,1.70,0.40
6,4.60,3.40,1.40,0.30
7,5.00,3.40,1.50,0.20

### Step 11. Reset the index so it begins with 0 again

In [12]:
iris.reset_index(inplace=True, drop=True)
iris.head()

,sepal_length (in cm),sepal_width (in cm),petal_length (in cm),petal_width (in cm)
0,4.60,3.10,1.50,0.20
1,5.00,3.60,1.40,0.20
2,5.40,3.90,1.70,0.40
3,4.60,3.40,1.40,0.30
4,5.00,3.40,1.50,0.20

### BONUS: Create your own question and answer it.